#!/Python37/python
# -*- coding: utf-8 -*-
# @Time : 2019/10/17 18:44
# @Author : xiaobink
# @File : 浅拷贝（浅复制）.py
# @Software: PyCharm

# 浅拷贝 只会复制字典本身，而字典中嵌套的dict则不会被复制
#copy() 用于对可变序列进行浅复制
# d={'a':1,'b':2}
# d1=d.copy()
# d1['a']=3  #改变d1的值不会改变到d的值
# print(d,id(d),d1,id(d1))
#{'a': 1, 'b': 2} 2424506165992 {'a': 3, 'b': 2} 2424506166072

# d=[1,2]
# d1=d.copy()
# d1[1]=3
# print(d,id(d),d1,id(d1))
#[1, 2] 2867189469768 [1, 3] 2867189470280

# d={'a':{'name':'葫芦娃','a':1,'b':2}}
# d1=d.copy()
# d1['a']['name']='黑猫警长'
# print(d,id(d),d1,id(d1))
# {'a': {'name': '黑猫警长', 'a': 1, 'b': 2}} 2034209467192 {'a': {'name': '黑猫警长', 'a': 1, 'b': 2}} 2034209467992

