#!/Python37/python
# -*- coding: utf-8 -*-
# @Time : 2019/10/22 20:12
# @Author : xiaobink
# @File : 面向对象简介.py.py
# @Software: PyCharm

#面向对象编程（oop）

# 一、什么是对象
# 对象就是内存中存储指定数据的一块区域
# 实际上对象就是一个容器，专门用来存储数据

# 二、对象的结构
# id（标识）
#id 用来标识对象的唯一性，每个对象都有唯一的id
# id是由解释器生成的，id就是对象的内存地址

# type（类型）
# 类型决定对象有哪些功能

#value（值）
# 值是对象中存储的具体数据
# 可变对象和不可变对象
#可变对象 list dic set
#不可变对象 Number(int float) str Tuple bool

#面向对象的举例
#面向对象可以理解为 语言中所有的操作都是通过对象来进行的

# 开门-->装大象-->关门
# 打开功能   存储功能  关闭功能  称之为面向过程（孩子吃瓜）
# 面向过程-->面向对象


#定义冰箱这么一个对象
# 第一 面向对象是一种思考问题的方式，面向对象是一种思想
#面向对象的特征：封装、继承、多态
# 第二 面向对象将事物变的简单化了
# （找代购，我只需要告诉他我要什么，至于去哪买，怎么买就不是我考虑的问题，而最终他帮我买回来，我给钱给他）

# 面向过程将一个功能分解成一个一个小的步骤
# 这种编程方式往往只适用于一个功能，我们要实现别的功能时，往往需要重新编写，复用性较低
#优点：符合人的思维，编写起来比较容易

#面向对象 就是让孩子吃瓜 容易维护 方便复用
# 缺点 不太符合人的思维方式，编写起来比较麻烦

