'''---知识点：html---'''

'''1.组成部分：
    在一个总的<html></html>元素中嵌套着两个主要的元素分别是：网页头<head></head>+网页体<body></body>
    网页头中的内容不在网页正文中出现，一般是定义网页窗口的标题，网页的编码格式，以及在网页体中要用到的元素属性及属性值，
    网页体的内容则是显示在网页正文中。
    2.标签：<>中间的字母，比如<head>是开始标签，</head>是结束标签，一般成对出现，也有特殊比如<meta charset='utf-8'>
    3.元素：开始标签+结束标签+中间的内容。
    常见元素有：h1 一级标题/h1，h2二级标题/h2，p段落/p,a链接的文本/a，div其他元素或文本/div
    4.class属性和id属性，都是用来对元素进行定位，查找，设定元素样式；id是具唯一性，不可重复的，class则可以。
    5.网页头中的style元素一般是对字体的大小，颜色，边距，浮动进行设定，其可以包含多种属性值，
    其中class对应的属性值用 .book 表示，id对应的属性值则用 #book 表示
    6.网页体分三大部分：header（顶部标题）、article（中间内容）、footer（底部页脚）
    7.article元素，可分为两部分：nav(侧边栏）、main(右边正文）
'''